/****************************************************************************
Во всех вариантах данной задачи необходимо реализовать
и использовать **сортировку вставками**.
****************************************************************************/

/****************************************************************************
Задача 1_4. Строки.

Напишите программу, печатающую набор строк в лексикографическом порядке.

Строки разделяются символом перевода строки '\n'. Если последний символ
в потоке ввода '\n', считать, что после него нет пустой строки. Максимальная
длина строки 255 символов. Написать свою функцию сравнения строк.

in   | out
---- | ---
4    | ab
caba | aba
abba | abba
ab   | caba
aba  |

****************************************************************************/
//Created by Yaishenka
//Copyright © 2017 Yaishenka. All rights reserved.

#include <iostream>
#include <cmath>
#include <string>
using namespace std;

int main () {
    int n;
    cin>>n;
    string arr [n];
    cin>>arr[0];
    for (int i(1);i<n;++i) {
        cin>>arr[i];
        string tmp=arr[i];
        int j=i-1;
        while ((tmp<arr[j]) && (j>=0)) {
            arr[j+1]=arr[j];
            j--;
        }
        arr[j+1]=tmp;
    }
    for (int i(0);i<n;++i) {
        cout<<arr[i]<<endl;
    }
}
//4 caba abba ab aba

