/****************************************************************************
Задача 3_2.

Дан массив целых чисел А[0..n-1]. Известно, что на интервале
[0, m] значения массива строго возрастают, а на интервале [m, n-1]
строго убывают. Найти m за O(log m).
2 ≤ n ≤ 10000.

  in                   | out
  ---------------------|-----
  10                   | 6
  1 2 3 4 5 6 7 6 5 4  | 

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

