/****************************************************************************
Задача 2_2.

Вычислить площадь выпуклого n-угольника, заданного
координатами своих вершин. Сначала вводится количество вершин, затем
последовательно целочисленные координаты всех вершин в порядке обхода по
часовой стрелке.
n < 1000, координаты < 10000.

*Указание.* Для вычисления площади n-угольника можно посчитать сумму
ориентированных площадей трапеций под каждой стороной многоугольника.

 in   | out
 -----|-----
 3    | 1.5
 0 1  |
 1 0  |
 2 2  |
****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

