/****************************************************************************
Задача 2_* (3 балла)

Дан массив целых чисел A[0..n). Массив произвольным образом заполнен
натуральными числами из диапазона [0..n - 1). Одно или несколько значений
в массиве может повторяться. Необходимо найти любой повтор за O(n), памяти O(1).
Исходный массив хранить можно, модифицировать нельзя.
n ≤ 10000.

  in               | out
  -----------------|-----
  8                | 1
  1 2 4 5 6 1 0 3  |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

