//
// Решение предполагает использование кучи.
//

/****************************************************************************
Задача 6_4. Скользящий максимум.

Дан массив натуральных чисел A[0..n), n не превосходит 10^8. Так же
задан размер некотрого окна (последовательно расположенных элементов
массива) в этом массиве k, k <= n. Требуется для каждого положения окна
(от 0 и до n-k) вывести значение максимума в окне. Скорость работы O(n * log n), память O(n).

*Формат входных данных.* Вначале вводится n - количество элементов
массива. Затем вводится n строк со значением каждого элемента. Затем
вводится k - размер окна.

*Формат выходных данных.* Разделенные пробелом значения максимумов для
каждого положения окна.

  in                  | out
  --------------------|----------------
  3                   | 2 3
  1 2 3               | 
  2                   | 

  in                  | out
  --------------------|----------------
  9                   | 8 8 8 10 10 10
  0 7 3 8 4 5 10 4 6  | 
  4                   | 

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

