//
// Решение предполагает использование стека.
// Способ реализации стека может быть любым (список/динамический массив).
//

/****************************************************************************
 Задача 5_1. Скобочная последовательность.

Дан фрагмент последовательности скобок, состоящей из символов (){}[].

Требуется определить, возможно ли продолжить фрагмент в обе стороны,
получив корректную последовательность.

Длина исходной последовательности ≤ 800000.

*Формат входных данных.* Строка, содержащая символы (){}[] и,
возможно, перевод строки.

*Формат выходных данных.* Если возможно - вывести минимальную корректную
последовательность, иначе - напечатать "IMPOSSIBLE".

  in          | out
  ------------|--------------------------
  {}[[[[{}[]  | {}[[[[{}[]]]]]
  {][[[[{}[]  | IMPOSSIBLE
  ]()}[](({}  | {[]()}[](({}))

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

