//
// Решение предполагает использование стека.
// Способ реализации стека может быть любым (список/динамический массив).
//

/****************************************************************************

Задача 5_4. Вычисление выражения.

Дано выражение в инфиксной записи. Вычислить его, используя перевод
выражения в постфиксную запись. Выражение не содержит отрицительных
чисел.
Количество операций ≤ 100.

*Формат входных данных.* Строка, состоящая их символов
"0123456789-+/*()"

Гарантируется, что входное выражение корректно, нет деления на 0,
вычислимо в целых числах. Деление целочисленное.

*Формат выходных данных.* Значение выражения.

  in                      | out
  ------------------------|-----
  1 + 2                   | 3
  200-(123+34*2)+(48-2)   | 55

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

